app/views/articles/_form.html.erb

                                        <%= f.label "Marca" %>
                                        <%= f.collection_select :make_id, Make.order(:name), :id, :name %>
---
SELECT "makes".* FROM "makes" ORDER BY name

                                        <%= f.label "Proovedor" %>
                                        <%= f.collection_select :supplier_id, Supplier.order(:name), :id, :name %>
---
SELECT "suppliers".* FROM "suppliers" ORDER BY name

                                        <%= f.label "Categoria" %>
                                        <%= f.collection_select :category_id, Category.order(:name), :id, :name %>
---
SELECT "categories".* FROM "categories" ORDER BY name