app/views/customers/_form.html.erb

          <%= f.input :location_id do %>
           <%= f.collection_select :location_id,  Location.order(:name), :id, :name, class: "span3" %>
---
SELECT "locations".* FROM "locations" ORDER BY name