app/views/customers/show.html.erb

SELECT "phones".* FROM "phones" WHERE "phones"."customer_id" = 1
---
  <b>Telefono</b>
  <% @customer.phones.each do |u| %>