lib/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE (LOWER(name) LIKE '%00%' or barcode LIKE '%00%')
---
def index
        @articles = Article.con_nombre(params[:q]) if params[:q].present?

INSERT INTO "articles" ("articles_code_supplier", "barcode", "category_id", "created_at", "make_id", "name", "percentaje", "price_cost", "price_total", "quantity", "supplier_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", "21"]]
UPDATE "articles" SET "barcode" = '7798151657305 ', "updated_at" = '2014-01-23 22:32:57.180667' WHERE "articles"."id" = 21
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])