lib/app/controllers/customers_controller.rb

def index
   @customers = Customer.con_nombre(params[:q]) if params[:q].present?
---
SELECT "customers".* FROM "customers" WHERE (LOWER(lastname) LIKE '%a%')