lib/app/controllers/invoices_controller.rb

SELECT "invoices".* FROM "invoices" WHERE "invoices"."customer_id" = 6
SELECT "payments".* FROM "payments" WHERE (invoice_id = 167)
SELECT SUM("payments"."amount") AS sum_id FROM "payments" WHERE (invoice_id = 161)
---
   def index

      @invoices = @customer.invoices.all
      @articles = Article.con_nombre_barcode(params[:q]) if params[:q].present?
      @payments = 0
      @invoices.each do |e|
         if e.cancelar_invoice == false
            @payments  += Payment.where('invoice_id = ?', e.id).sum(&:amount)

SELECT "invoices".* FROM "invoices" WHERE "invoices"."customer_id" = 3 AND "invoices"."id" = $1 LIMIT 1  [["id", "168"]]
---
   def show
      @invoice = @customer.invoices.find(params[:id])

INSERT INTO "invoices" ("cancelar_invoice", "created_at", "current_account", "customer_id", "price_total", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
   def create
      @articles = Article.con_nombre(params[:q]) if params[:q].present?
      @invoice = @customer.invoices.new(params[:invoice])
      @id = @invoice.orders(params[:articles_id])
      @quantity = Article.quantity_order(@id)


      respond_to do |format|
         if @invoice.save

SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", "6"]]
---
   def load_customers
      @customer = Customer.find(params[:customer_id])