app/controllers/articles_controller.rb

def index
        @articles = Article.con_nombre_barcode(params[:q]) if params[:q].present?
      #  @articles = Article.proveedor(params[:supplier_id]) if params[:supplier_id].present?
        @articles = Article.con_id(params[:article_id]) if params[:article_id].present?
        #@articles = Article.all if !params[:q].present? and !params[:article_id].present? and !params[:supplier_id].present?
        #          @articles = Article.all
        @articles = @articles.paginate(page: params[:page], per_page: 10)
---
SELECT "articles".* FROM "articles" LIMIT 1
SELECT "articles".* FROM "articles" WHERE (LOWER(name) LIKE '%pa%' or barcode = '%pa%') LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "articles"

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("articles_code_supplier", "barcode", "category_id", "created_at", "make_id", "name", "percentaje", "price_cost", "price_total", "quantity", "supplier_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "articles" SET "price_cost" = 150.0, "percentaje" = 0.0, "price_total" = 150.0, "updated_at" = '2014-06-07 18:53:36.631283' WHERE "articles"."id" = 2

 def example
    	@example = Article.limit(10)
---
SELECT "articles".* FROM "articles"