app/controllers/customers_controller.rb

def index
  @customers = Customer.all
   @customers = Customer.con_nombre(params[:q]) if params[:q].present?
   @customers = Customer.con_id(params[:customer_id]) if params[:customer_id].present?
  @customers = @customers.paginate(page: params[:page], per_page: 10)
---
SELECT "customers".* FROM "customers" WHERE (LOWER(lastname) LIKE '%pa%')
SELECT "customers".* FROM "customers" WHERE (LOWER(lastname) LIKE '%a%') LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "customers" WHERE (LOWER(lastname) LIKE '%a%')

  def create
    #@customer = Customer.new(params[:customer].merge(:user_id => current_user.id))
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("address", "bar_code", "category", "company_id", "created_at", "cuit", "date_of_birth", "description", "dni", "email", "lastname", "location_id", "name", "neighborhood", "reference_direction", "removed", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"