app/controllers/invoices_controller.rb

   def index
      @invoices = Invoice.all
      @articles = Article.con_nombre_barcode(params[:q]) if params[:q].present?
      @payments = 0
      @invoices.each do |e|
         if e.cancelar_invoice == false
            @payments  += Payment.where('invoice_id = ?', e.id).sum(&:amount)
---
SELECT "invoices".* FROM "invoices"
SELECT "payments".* FROM "payments" WHERE (invoice_id = 1)
SELECT SUM("payments"."amount") AS sum_id FROM "payments" WHERE (invoice_id = 1)

   def show
      @invoice = Invoice.find(params[:id])
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", "3"]]

   def edit
      @invoice = Invoice.find(params[:id])
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", "1"]]

   def create
      @articles = Article.con_nombre_barcode(params[:q]) if params[:q].present?
      @invoice = Invoice.new(params[:invoice].merge(customer_id: params[:customer_id]))
      @id = @invoice.orders(params[:article_id])
      @quantity = Article.quantity_order(@id)
      respond_to do |format|
         if @invoice.save
---
INSERT INTO "invoices" ("cancelar_invoice", "created_at", "current_account", "customer_id", "price_total", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "orders" ("articles_id", "created_at", "discount", "invoice_id", "name", "price_total", "quantity", "unit_price", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

   def update
      @invoice = Invoice.find(params[:id])

      respond_to do |format|
         if @invoice.update_attributes(params[:invoice])
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "invoices" SET "price_total" = 237.32, "updated_at" = '2014-06-07 18:46:33.398159' WHERE "invoices"."id" = 2

   def update_invoice

      @invoice  =   Invoice.find(params[:invoice_id])
      @order = @invoice.orders
      @price_invoice_total = 0
         @order.each do |product|

               @article = Article.find(product.article_id)
               @price_unit = @article['price_total'].to_f
               @price_total = (@price_unit  - (@price_unit * (product.discount)/100)) * product.quantity

               product.update_attributes!(unit_price: @price_unit, price_total: @price_total)
               @price_invoice_total += @price_total
         end

               @invoice.update_attributes!( price_total: @price_invoice_total)
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "orders".* FROM "orders" WHERE "orders"."invoice_id" = 1
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "invoices" SET "price_total" = 77.0, "updated_at" = '2014-06-07 18:44:30.898729' WHERE "invoices"."id" = 1
UPDATE "orders" SET "unit_price" = 77.0, "price_total" = 77.0, "updated_at" = '2014-06-07 18:41:15.924303' WHERE "orders"."id" = 1

   def load_customers
      @customer = Customer.find(params[:customer_id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", "1"]]