app/controllers/invoices_controller.rb

        def index

    @invoices = @customer.invoices.all
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."customer_id" = 1

  def show
    @invoice = @customer.invoices.find(params[:id])
---
SELECT "invoices".* FROM "invoices" WHERE "invoices"."customer_id" = 1 AND "invoices"."id" = $1 LIMIT 1  [["id", "1"]]