lib/app/views/articles/index.html.erb

SELECT "suppliers".* FROM "suppliers" ORDER BY name
---
      <div class="search">
         <%= f.collection_select :supplier_id, Supplier.order(:name), :id, :name %>