app/views/suppliers/_form.html.erb

SELECT "locations".* FROM "locations" ORDER BY name
---
   <%= f.input :location_id do %>
     <%= f.select :location_id,  Location.order("name").map {|l|[l.name + " - "+ l.departament + " - "+ l.province, l.id]}, prompt: "Seleccione una Localidad" %>